In [1]:
%load_ext sql

In [2]:
learning_db = f'postgresql://postgres:SANket147@localhost/Learning'

In [4]:
%%sql $learning_db
select * from personal_details

6 rows affected.

[(1, 'Sanket', 'Wagh', '9762151814', 1),
 (2, 'Sukanya', 'Wagh', '9762151815', 2),
 (3, 'Utsav', 'Bhowmik', '9762151816', 4),
 (4, 'Aditya', 'Jamdade', '9762151817', 3),
 (5, 'Utssav', 'Bhowmik', '9762151818', 8),
 (6, 'idli', 'sambhar', '2414134124', 9)]

In [5]:
%%sql
update personal_details
set f_name = 'Sunil',
l_name = 'Shetty'
where id=6

 * postgresql://postgres:***@localhost/Learning
1 rows affected.

[]

In [6]:
%sql select * from personal_details

 * postgresql://postgres:***@localhost/Learning
6 rows affected.

[(1, 'Sanket', 'Wagh', '9762151814', 1),
 (2, 'Sukanya', 'Wagh', '9762151815', 2),
 (3, 'Utsav', 'Bhowmik', '9762151816', 4),
 (4, 'Aditya', 'Jamdade', '9762151817', 3),
 (5, 'Utssav', 'Bhowmik', '9762151818', 8),
 (6, 'Sunil', 'Shetty', '2414134124', 9)]

'This is me editing'

'--HELLO---'